Revit 2027 API
Noise.NoisePhase Property
 The property labeled "Phase" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string NoisePhase { get; }
Public Shared ReadOnly Property NoisePhase As String
	Get
public:
static property String^ NoisePhase {
	String^ get ();
}
static member NoisePhase : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
Noise Class
Autodesk.Revit.DB.Visual Namespace